Repository: LinuCC/BaBeSK
Catalog: code/locale/*/LC_MESSAGES/BaBeSK_*.po
Languages: de_de

source: Could not delete the Classteacher!
de_de: Konnte den Kursleiter nicht löschen!

source: Could not fetch the Classteachers
de_de: Konnte die Kursleiter nicht abrufen!

source: The User was successfully added
de_de: Der Benutzer wurde erfolgreich hinzugefügt

source: Could not add the User to the Class
de_de: Konnte den Benutzer nicht zu dem Kurs zuweisen!

source: The users were successfully assigned to their respective classes!
de_de: Die Benutzer wurden erfolgreich ihren Kursen zugewiesen.

source: Could not delete the old Joints!
de_de: Die alten Zuweisungen konnte nicht gelöscht werden!

source: Could not add the new Joints!
de_de: Konnte die neuen Zuweisungen nicht hinzufügen!

source: Could not check if the UsersToClasses-Table exists!
de_de: Konnte nicht überprüfen ob die Benutzer-In-Kurse-Tabelle existiert!

source: The User was successfully moved.
de_de: Der Benutzer wurde erfolgreich verschoben.

source: Could not move the User to the other Class!
de_de: Konnte die Benutzer nicht zu dem anderen Kurs verschieben!

source: Could not fetch the Status
de_de: Konnte den Status nicht abrufen!

source: The Status of the User was successfully changed
de_de: Der Status des Nutzers wurde erfolgreich geändert.

source: Could not change the Status of the User
de_de: Konnte den Status des Nutzers nicht verändern!

source: Error while fetching the data!
de_de: Ein Fehler ist beim Abrufen der Daten aufgetreten!

source: Could not fetch all classes of the active schoolyear
de_de: Konnte nicht alle Kurse des aktiven Schuljahres abrufen

source: Could not fetch the User-Assignments
de_de: Konnte die Benutzerzuweisungen nicht abrufen!

source: Could not fetch the Temporary Assignments!
de_de: Konnte die temporären Zuweisungen nicht abrufen!

source: The Data was successfully Assigned. You can now go back and view and edit the temporary changes
de_de: Die Daten wurden erfolgreich zugewiesen. Sie können jetzt zurückgehen und die temporären Veränderungen einsehen und bearbeiten.

source: Could not create the UsersToClasses-Table!
de_de: Konnte die Benuter-in-Kurse-Tabelle nicht erstellen!

source: Could not delete the UsersToClasses-Table!
de_de: Konnte den die Benutzer-in-Kurs-Tabelle nicht löschen!

source: Could not fetch the status
de_de: Konnte den Status nicht abrufen

source: Could not fetch the requests!
de_de: Konnte die Anfragen nicht abrufen!

source: Could not upload the data!
de_de: Konnte die Daten nicht hochladen!

source: Could not newly assign the User to the Class!
de_de: Konnte den Benutzer nicht neu zu dem Kurs hinzufügen!

source: The User was successfully assigned to the Class.
de_de: Der Benutzer wurde erfolgreich der Klasse zugewiesen.

source: No User found by the Username!
de_de: Keinen Benutzer bei seinem Benutzernamen gefunden!

source: Error while fetching the User from the Database!
de_de: Ein Fehler ist beim Abrufen der Benutzer von der Datenbank aufgetreten!

source: Error analyzing the statistics!
de_de: Ein Fehler ist beim analysieren der Statistiken aufgetreten!

source: No ST
de_de: Kein ST

source: wrong action-value!
de_de: Falsche action-value!

source: Grade "%1$s-%2$s" was successfully added
de_de: Die Klasse "%1$s-%2$s" wurde erfolgreich hinzugefügt

source: Gradelabel
de_de: Klassenbezeichnung

source: Gradelevel
de_de: Klassenjahrgang

source: Schooltype
de_de: Schultyp

source: Error adding the Grade "%1$s-%2$s"
de_de: Konnte die Klasse "%1$s-%2$s" nicht hinzufügen!

source: Could not fetch the Grades
de_de: Konnte die Klassen nicht abrufen

source: No Grades found
de_de: Keine Klassen gefunden

source: The Grade was successfully deleted
de_de: Die Klasse wurde erfolgreich gelöscht

source: Error deleting the Grade with the ID %1$s!
de_de: Konnte die Klasse mit der ID %1$s nicht löschen!

source: Could not delete the Joins of the GradeId "%1$s"
de_de: Konnte die Verbindungen zur KlassenID "%1$s" nicht löschen!

source: Could not fetch the Grade
de_de: Konnte die Klasse nicht abrufen!

source: The Grade was successfully changed
de_de: Die Klasse wurde erfolgreich verändert

source: Could not change the Grade!
de_de: Konnte die Klasse nicht verändern!

source: The Module is deactivated! You need to activate it first in the ModuleSettings.
de_de: Das Modul ist deaktiviert! Sie müssen es zuer in den Moduleinstellungen aktivieren

source: Could not remove the Module from the Database!
de_de: Kontne das Modul nicht von der Datenbank löschen!

source: Wrong action-value!
de_de: Falsche action-value!

source: An active schoolyear already exists! Please add the schoolyear without it being active and then activate it in the menu.
de_de: Ein aktives Schuljahr existiert bereits! Bitte aktivieren sie das Schuljahr erst nach dem Hinzufügen.

source: The Schoolyear was added successfully
de_de: Das Schuljahr wurde erfolgreich hinzugefügt

source: Could not check if an active schoolyear already exists
de_de: Konnte nicht überprüfen ob ein aktiviertes Schuljahr bereits existiert!

source: Name of Schoolyear
de_de: Name des Schuljahres

source: Could not add the Schoolyear
de_de: Konnte das Schuljahr nicht hinzufügen

source: Error Fetching the Schoolyears!
de_de: Konnte die Schuljahre nicht abrufen

source: The Schoolyear was successfully deleted
de_de: Das Schuljahr wurde erfolgreich gelöscht

source: The Schoolyear was not deleted
de_de: Das Schuljahr wurde nicht gelöscht

source: Could not delete the Schoolyear!
de_de: Konnte das Schuljahr nicht löschen!

source: The Schoolyear was successfully activated
de_de: Das Schuljahr wurde erfolgreich aktiviert

source: Could not fetch the Schoolyear from the Database
de_de: Kontne das Schuljahr nicht von der Datenbank abrufen

source: The Schoolyear was successfully changed
de_de: Das Schuljahr wurde erfolgreich verändert

source: Could not change the Schoolyear
de_de: Konnte das Schuljahr nicht verändern

source: No schoolyear selected!
de_de: Kein Schuljahr ausgewählt!

source: Name of the Schoolyear
de_de: Name des Schuljahres

source: Is the Schoolyear active
de_de: Ob das Schuljahr aktiv ist

source: Add an Schoolyear
de_de: Ein Schuljahr hinzufügen

source: Do you really want to activate the Schoolyear "%1$s"? The other activated Schoolyear will be deactivated
de_de: Wollen sie wirklich das Schuljahr "%1$s" aktivieren? Das andere aktive Schuljahr wird deaktiviert

source: Yes, I want to activate the Schoolyear
de_de: Ja, ich will das Schuljahr aktivieren

source: No, I do not want to activate the Schoolyear
de_de: Nein, ich will das Schuljahr nicht aktivieren

source: Change the Schoolyear
de_de: Das Schuljahr verändern

source: Change Schoolyear
de_de: Schuljahr verändern

source: Do you really want to delete the Schoolyear "%s"? WARNING: Problems will occur if you do this! Not all parts of the system support this!
de_de: Wollen sie wirklich das Schuljahr "%s" löschen? WARNUNG: Fehler werden auftreten wenn sie dies tuen! Nicht alle Teile des Systems unterstützen dies!

source: Yes, I want to break the System and delete the Schoolyear
de_de: Ja, ich will das System zerstören und das Schuljahr löschen

source: No, I do not want to break the System and delete the Schoolyear
de_de: Nein, ich will das System nicht zerstören und das Schuljahr nicht löschen

source: Successfully switched the Schoolyear!
de_de: Erfolgreich zu dem Schuljahr gewechselt!

source: Could not switch the Schoolyear!
de_de: Konnte nicht zu dem Schuljahr wechseln!

source: Could not add Users to their new Grade and Schoolyear!
de_de: Konnte die Benutzer nicht zu ihrer Klasse und Schuljahre hinzufügen!

source: Grade %1$s-%2$s could not be found! You should add it to the Grades to allow users to be moved in there
de_de: Klasse %1$s-%2$s konnte nicht gefunden werden! Sie sollten diese Klasse hinzufügen damit Benutzer dahin verschieben werden können

source: Error changing the user.
de_de: Fehler beim Verändern eines Benutzers.

source: Missing id of the user!
de_de: Id des Nutzers fehlt!

source: Please set the preset password before reseting the users passwords.
de_de: Bitte setzen sie das voreingestellte Passwort bevor sie die Passwörter der Benutzer zurücksetzen.

source: The passwords were successfully resetted to the preset password.
de_de: Die Passwörter wurden erfolgreich zu dem voreingestellten Passwort zurückgesetzt.

source: Could not check if first Password on Login is enabled!
de_de: Konnte nicht überprüfen ob das passwort beim ersten Login verändert werden soll!

source: Could not remove the special characters!
de_de: Konnte die Spezialzeichen nicht entfernen!

source: The special characters were successfully removed!
de_de: Die Sonderzeichen wurden erfolgreich entfernt!

source: Could not fetch the Classes!
de_de: Konnte die Kurse nicht abrufen!

source: Could not fetch the User-in-Class-Statuses!
de_de: Konnte die Benutzer-In-Klasse-Status nicht ändern!

source: Could not fetch the Classes of the User
de_de: Konnte die Kurse des Benutzers nicht abrufen

source: Error fetching the Usergroups
de_de: Konnte die Benutzergruppen nicht abrufen

source: Email-Address
de_de: Email-Adresse

source: Schoolyear
de_de: Schuljahr

source: Grade
de_de: Klasse

source: PricegroupId
de_de: Preisgruppen-ID

source: is Soli
de_de: ist Soli

source: Babesk is deactivated!
de_de: Babesk ist deaktiviert!

source: Pricegroups
de_de: Preisgruppen

source: Could not add the Schoolyear and the Grade to the User "%1$s" "%2$s"
de_de: Konnte das Schuljahr und die Klasse nicht zu dem Benutzer "%1$s" "%2$s" hinzufügen

source: The User "%1$s %2$s" has a Grade, but no Schoolyear defined! Define a Schoolyear for Users with a Grade!
de_de: Der Benutzer "%1$s %2$s" hat eine Klasse, aber kein Schuljahr definiert! Definieren sie ein Schuljahr mit Klasse für Benutzer!

source: Multiple Grades with gradelevel "0" found!
de_de: Mehrere Klassen mit Jahrgang "0" gefunden!

source: Could not find the ID of the "NoGrade"-Grade
de_de: Konnte die ID der "KeineKlasse"-Kasse nicht finden!

source: Could not find the Pricegroup %1$s!
de_de: Konnte die Preisgruppen "%1$s" nicht finden!

source: Could not find the Usergroup by Path "%1$s"
de_de: Konnte die Nutzergruppe anhand des Pfads "%1$s" nicht finden

source: The userdata were changed successfully.
de_de: Die Benutzerdaten wurden erfolgreich verändert.

source: Please resolve the conflicts before comitting the changes
de_de: Bitte lösen sie die Konflikte bevor sie die Veränderungen durchführen

source: Could not upload the userchanges!
de_de: Konnte die Benutzerveränderungen nicht hochladen!

source: Could not fetch the grades!
de_de: Konnte die Klassen nicht abrufen!

source: Could not commit the new users!
de_de: Konnte die neuen Benutzer nicht hochladen!

source: Could not get the group for the new users!
de_de: Konnte die Gruppe für die neuen Nutzer nicht abrufen!

source: Could not add the grade!
de_de: Konnte die Klasse nicht hinzufügen!

source: Could not fetch the new users!
de_de: Konnte die neuen Nutzer nicht abrufen!

source: Could not switch to the new Schoolyear!
de_de: Konnte nicht zu dem neuen Schuljahr wechseln!

source: Please answer the questions given to resolve the conflicts.
de_de: Bitte beantworten sie die Fragen um die Konflikte zu lösen.

source: Error fetching the data!
de_de: Ein Fehler ist beim Abrufen der Daten aufgetreten!

source: Wrong type?!
de_de: Falscher Typ?!

source: Not implemented yet!
de_de: Noch nicht implementiert!

source: Missing Session-Variable! Please begin again.
de_de: Die Session-Variable fehlt! Bitte fangen sie von vorne an.

source: An error occured while parsing the csvfile: %1$s
de_de: Ein Fehler ist beim parsen der Csv-Datei aufgetreten: %1$s

source: An error occured while importing the csv-file. The file is missing the column "%1$s"!
de_de: Ein Fehler ist beim Importieren der CSV-Datei aufgetreten. Es fehlt die Spalte "%1$s"!

source: Errors occured while importing the csv-file. Please correct them and try again.<br />%1$s
de_de: Es sind Fehler beim Importieren der CSV-Datei aufgetreten. Bitte korrigieren sie diese und versuchen sie es nochmal.<br />%1$s

source: Could not fetch the users!
de_de: Konnte die Benutzer nicht abrufen!

source: Could not fetch the conflict scope from server!
de_de: Konnte den Konfliktbereich nicht vom Server abrufen!

source: Full year
de_de: Schuljahr

source: Half year
de_de: Halbjahr

source: Could not fetch the schoolyears!
de_de: Konnte die Schuljahre nicht abrufen!

source: Could not load the user-groups. Adding new users to groups is disabled!
de_de: Konnte die Benutzergruppen nicht laden. Neue Nutzer zu Gruppen hinzufügen ist deaktiviert!

source: Could not initialize the process!
de_de: Konnte den Prozess nicht initialisieren!

source: Could not check if the schoolyear has already been used
de_de: Konnte nicht überprüfen ob das Schuljahr bereits benutzt wurde

source: Wrong type of switch-type of schoolyear!
de_de: Falscher Wechsel-Typ des Schuljahres!

source: The Schoolyear with this Id does not exist!
de_de: Ein Schuljahr mit dieser Id existiert nicht!

source: The formular was not filled out completely. Please correct your mistakes and try again.
de_de: Das Formular wurde nicht vollständig ausgefüllt. Bitte korrigieren sie ihre Fehler und versuchen sie es nochmal.

source: Could not check if this has done before!
de_de: Konnte nicht überprüfen ob dies bereits vorher getan wurde!

source: modulepath_
de_de: NOT USED

source: No File has been uploaded!
de_de: Keine Datei wurde hochgeladen!

source: Could not parse the Csv-File!
de_de: Konnte die CSV-Datei nicht lesen!

source: The CSV-File is void!
de_de: Die CSV-Datei ist leer!

source: The CSV-File has only one column!
de_de: Die CSV-Datei hat nur eine Spalte!

source: Could not upload the CSV-File correctly
de_de: Konnte die CSV-Datei nicht korrekt hochladen

source: Could not check the Inputdata
de_de: Konnte die Eingabedaten nicht überprüfen

source: Could not parse the Input-data
de_de: Konne die Eingabedaten nicht überprüfen

source: Could not commit the Data
de_de: Konnte die Daten nicht hochladen!

source: Could not upload the CSV-File!
de_de: Konnte die CSV-Datei nicht hochladen!

source: Could not find the Schoolyear "%1$s"
de_de: Konnte das Schuljahr "%1$s" nicht finden!

source: modulepath_root/publicData
de_de: öffentliche Daten

source: modulepath_root/publicData/JsDataProcessor
de_de: Javascript-Dateninterface

source: modulepath_root/publicData/JsDataProcessor/InputdataCheck
de_de: Eingabedatenüberprüfung

source: modulepath_root/publicData/GeneralPublicData
de_de: öffentliche Daten

source: modulepath_root/publicData/GeneralPublicData/LoginHelp
de_de: Login-Hilfe

source: modulepath_root/publicData/Babesk
de_de: Bargeldloses Bestellsystem

source: modulepath_root/publicData/Babesk/Menu
de_de: Menü des Bargeldlosen Bestellsystems

source: modulepath_root/web
de_de: Nutzer-Interface

source: modulepath_root/web/Settings
de_de: Einstellungen

source: modulepath_root/web/Settings/SettingsChangePassword
de_de: Passwort ändern

source: modulepath_root/web/Settings/SettingsMainMenu
de_de: Einstellungshauptmenü

source: modulepath_root/web/Settings/ChangeEmail
de_de: Emailadresse verändern

source: modulepath_root/web/Settings/ChangePresetPassword
de_de: Voreingestelltes Passwort verändern

source: modulepath_root/web/Schbas
de_de: Schulbuchausleihesystem

source: modulepath_root/web/Schbas/LoanSystem
de_de: root/web/Schbas/LoanSystem

source: modulepath_root/web/Messages
de_de: Nachrichten

source: modulepath_root/web/Messages/MessageMainMenu
de_de: Nachrichtenhauptmenü

source: modulepath_root/web/Messages/MessageAdmin
de_de: Nachrichtenadministration

source: modulepath_root/web/PVau
de_de: Persönlicher Vertretungsplan

source: modulepath_root/web/PVau/Pvp
de_de: root/web/PVau/Pvp

source: modulepath_root/web/Kuwasys
de_de: Kurswahlsystem

source: modulepath_root/web/Kuwasys/ClassList
de_de: Kursliste

source: modulepath_root/web/Kuwasys/MainMenu
de_de: Kurswahlhauptmenü

source: modulepath_root/web/Kuwasys/ClassDetails
de_de: Kursdetails

source: modulepath_root/web/Fits
de_de: Führerschein für IT-Systeme

source: modulepath_root/web/Fits/Zeugnis
de_de: FITS-Zeugnis

source: modulepath_root/web/Fits/Quiz
de_de: Fits-Quiz

source: modulepath_root/web/Fits/Fmenu
de_de: Fits-Menü

source: modulepath_root/web/Babesk
de_de: Bargeldloses Bestellsystem

source: modulepath_root/web/Babesk/Order
de_de: Bestellen

source: modulepath_root/web/Babesk/Menu
de_de: Babesk-Menü

source: modulepath_root/web/Babesk/Help
de_de: Babesk-Hilfe

source: modulepath_root/web/Babesk/ChangePassword
de_de: Passwort verändern

source: modulepath_root/web/Babesk/Cancel
de_de: Bestellung rückgängig machen

source: modulepath_root/web/Babesk/Account
de_de: Account-Einstellungen

source: modulepath_root/administrator
de_de: Administrator-Interface

source: modulepath_root/administrator/Gnissel
de_de: Gnissel

source: modulepath_root/administrator/Gnissel/GDelUser
de_de: Benutzer löschen

source: modulepath_root/administrator/Gnissel/GChangeCard
de_de: Kartenwechsel

source: modulepath_root/administrator/Gnissel/GUnlockUser
de_de: Benutzer freischalten

source: modulepath_root/administrator/Gnissel/GChangePassword
de_de: Passwort ändern

source: modulepath_root/administrator/Gnissel/GCardInfo
de_de: Karteninfo

source: modulepath_root/administrator/Statistics
de_de: Statistiken

source: modulepath_root/administrator/Statistics/KuwasysStats
de_de: Kurswahlsystem-Statistiken

source: modulepath_root/administrator/Statistics/SchbasStatistics
de_de: Schbas-Statistiken

source: modulepath_root/administrator/Statistics/MessageStats
de_de: Nachrichten-Statistiken

source: modulepath_root/administrator/Kuwasys
de_de: Kurswahlsystem

source: modulepath_root/administrator/Kuwasys/Classteachers
de_de: Kursleitereinstellungen

source: modulepath_root/administrator/Kuwasys/Classes
de_de: Kurseinstellungen

source: modulepath_root/administrator/Kuwasys/KuwasysUsers
de_de: Benutzereinstellungen

source: modulepath_root/administrator/Schbas
de_de: Schulbuchausleihe

source: modulepath_root/administrator/Schbas/SchbasMessages
de_de: Schulbuchausleihenachrichten

source: modulepath_root/administrator/Schbas/SchbasAccounting
de_de: Buchhaltung

source: modulepath_root/administrator/Schbas/SchbasSettings
de_de: Schulbuchausleiheeinstellungen

source: modulepath_root/administrator/Schbas/BookInfo
de_de: Buchinformationen

source: modulepath_root/administrator/Schbas/Retour
de_de: Buchrückgabe

source: modulepath_root/administrator/Schbas/Loan
de_de: Schulbuchausleihe

source: modulepath_root/administrator/Schbas/Inventory
de_de: Inventar

source: modulepath_root/administrator/Schbas/Booklist
de_de: Bücherliste

source: modulepath_root/administrator/Messages
de_de: Nachrichten

source: modulepath_root/administrator/Messages/MessageAdmin
de_de: Nachrichteneinstellungen

source: modulepath_root/administrator/Messages/MessageTemplate
de_de: Nachrichtenvorlagen

source: modulepath_root/administrator/Messages/MessageAuthor
de_de: Nachrichtenautor

source: modulepath_root/administrator/Fits
de_de: Führerschein für IT-Systeme

source: modulepath_root/administrator/Fits/FitsSettins
de_de: FITS Einstellungen

source: modulepath_root/administrator/Fits/FitsCheck
de_de: FITS überprüfen

source: modulepath_root/administrator/Babesk
de_de: Bargeldloses Bestellsystem

source: modulepath_root/administrator/Babesk/Soli
de_de: Teilhabepaket

source: modulepath_root/administrator/Babesk/Recharge
de_de: Karte aufladen

source: modulepath_root/administrator/Babesk/Priceclass
de_de: Preisklasseneinstellung

source: modulepath_root/administrator/Babesk/Menu
de_de: Menü

source: modulepath_root/administrator/Babesk/Meals
de_de: Mahlzeiteinstellung

source: modulepath_root/administrator/Babesk/Checkout
de_de: Ausgabe

source: modulepath_root/administrator/System
de_de: Systemeinstellungen

source: modulepath_root/administrator/System/Schooltype
de_de: Schultyp

source: modulepath_root/administrator/System/CardChange
de_de: Kartenwechsel

source: modulepath_root/administrator/System/WebHomepageSettings
de_de: Webseiteneinstellung

source: modulepath_root/administrator/System/PresetPassword
de_de: Voreingestelltes Passwort

source: modulepath_root/administrator/System/EmailConfiguration
de_de: Emaildaten-Konfiguration

source: modulepath_root/administrator/System/CardInfo
de_de: Karteninformationen

source: modulepath_root/administrator/System/Logs
de_de: Logeinstellungen

source: modulepath_root/administrator/System/Groups
de_de: Preisgruppen

source: modulepath_root/administrator/System/Admin
de_de: Administratoreinstellungen

source: modulepath_root/administrator/System/Help
de_de: Hilfeeinstellungen

source: modulepath_root/administrator/System/SpecialCourse
de_de: Oberstufenkurse

source: modulepath_root/administrator/System/ForeignLanguage
de_de: Fremdsprachen

source: modulepath_root/administrator/System/Religion
de_de: Religionseinstellungen

source: modulepath_root/administrator/System/User
de_de: Benutzereinstellungen

source: modulepath_root/administrator/System/Grade
de_de: Klassen

source: root/administrator/Babesk/Checkout
de_de: Ausgabe

source: modulepath_root/administrator/Babesk/BabeskTimeSettings
de_de: Zeiteinstellungen

source: modulepath_root/administrator/Fits/FitsSettings
de_de: FITS Einstellungen

source: modulepath_root/administrator/System/GroupSettings
de_de: Benutzergruppen

source: modulepath_root/administrator/System/ModuleSettings
de_de: Moduleinstellungen

source: modulepath_root/administrator/System/Schoolyear
de_de: Schuljahr

source: Error occured while fetching the books by class
de_de: Ein Fehler ist beim Abrufen der Bücher nach Klassen aufgetreten

source: Error occured while fetching the books by topic
de_de: Ein Fehler ist beim Abrufen der Bücher nach Thema aufgetreten

source: Error occured while fetching the meals
de_de: Ein Fehler ist beim Abrufen der Mahlzeiten aufgetreten

source: Error occured while fetching the meal-ids at date
de_de: Ein Fehler ist beim Abrufen der Mahlzeiten am Datum aufgetreten

source: Error while logging you in!
de_de: Beim einloggen ist ein Fehler aufgetreten!

source: Please input both username and password!
de_de: Bitte geben sie sowohl Benutzername als auch Passwort ein!

source: The input of field %1$s contains invalid characters or is too short!
de_de: Die Eingabe von Feld %1$s beinhaltet ungültige Zeichen oder ist zu kurz!

source: Account is locked!
de_de: Der Account ist gesperrt!

source: Error executing the Module!
de_de: Konnte das Modul nicht ausführen!

source: You have no access to web!
de_de: Du hast keine Berechtigung für das Web-Modul!

source: Could not check if the Soliprice is enabled!
de_de: Konnte nicht überprüfen ob der Teilhabepaket-Preis aktiviert ist!

source: The helptext is void
de_de: Der Hilfetext ist leer

source: Could not fetch the helptext.
de_de: Konnte den Hilfetext nicht abrufen.

source: Go to Main menu
de_de: Zum Hauptmenü

source: Could not fetch the class-details!
de_de: Konnte die Kursdetails nicht abrufen!

source: Could not display the class-details!
de_de: Konnte die Kursdetails nicht anzeigen!

source: Registrations are not allowed for the moment!
de_de: Kursregistrierungen sind momentan nicht erlaubt!

source: Could not display the list!
de_de: Konnte die Liste nicht anzeigen!

source: Error checking the input data!
de_de: Ein Fehler ist beim überprüfen der eingegebenen Daten aufgetreten!

source: Back to main menu
de_de: Zum Hauptmenü

source: Your choices where added. You can see your registrations in the main menu.
de_de: Deine Wahlen wurden hinzugefügt. Du kannst die Registrationen im Hauptmenü einsehen.
