Repository: LinuCC/BaBeSK
Catalog: code/locale/*/LC_MESSAGES/BaBeSK_*.po
Languages: de_de

source: Kuwasys User-Mainmenu
de_de: Kuwasys Benutzer-Hauptmenü

source: Printables
de_de: Druckbares

source: Here you can Print PDFs confirming the Participation of Users at their Classes of this Year
de_de: Hier können sie PDF-Dateien erstellen die die Teilnahmen der Nutzer an Kursen in diesem Jahr bestätigen.

source: Create Participation Confirmation
de_de: Teilnahmebestätigung erstellen

source: Bulk-Changes
de_de: Massenveränderungen

source: Here you can assign the Users that submitted requests to Classes of the active Year
de_de: Hier können sie Nutzer den von ihnen gewünschten Kursen zuweisen.

source: Assign the Users to the Classes
de_de: Die Benutzer den Kursen zuordnen

source: Actions
de_de: Aktionen

source: Go to the existing Assignment-Process
de_de: Zum existierenden Zuweisungs-Prozess gehen

source: Bulk-Actions
de_de: Massenänderungnen

source: Start a new Assignment-Process
de_de: Einen neuen Zuweisungsprozess starten (Warnung - löscht den alten Prozess, falls vorhanden)

source: Assign all Users to their Classes
de_de: Alle Benutzer ihren Kursen zuordnen

source: Really start a new Assignment-Process?
de_de: Wollen sie wirklich einen neuen Zuweisungsprozess starten?

source: If you have already started an Assignment-Process, the Data will be inevitably lost. Are you sure?
de_de: Wenn sie bereits einen Zuweisungsprozess gestartet haben, werden die Daten verloren gehen. Sind sie sicher?

source: Classdetails of Class
de_de: Details des Kurses

source: Username
de_de: Benutzername

source: Class
de_de: Kurs

source: Create Class-Summaries
de_de: Klassenübersichten erstellen

source: Cancel
de_de: Abbrechen

source: Create
de_de: Erstellen

source: Classregistrations are not allowed
de_de: Kursregistrierungen sind nicht erlaubt

source: Classregistrations are allowed
de_de: Kursregistrierungen sind erlaubt

source: Standard-Actions
de_de: Standard-Aktionen

source: Add a Class
de_de: Ein Kurs hinzufügen

source: Display all Classes
de_de: Alle Kurse anzeigen

source: More Actions
de_de: Mehr Aktionen

source: Import Classes with a CSV-File
de_de: Kurse mit einer CSV-Datei importieren

source: Change if Classregistrations are enabled
de_de: Ändern, ob Kursregistrierungen erlaubt sind

source: Please select the User and the Status of the Assignment
de_de: Bitte geben sie den Benutzernamen des Nutzers und den Status der Zuweisung ein.

source: Add the user to the class
de_de: Den Benutzer den Kurs zuordnen

source: Assign a User to this Class
de_de: Einen Benutzer den Kursen zuordnen

source: Classteacher
de_de: Kursleiter

source: Day
de_de: Tag

source: execute Changes
de_de: Änderungen ausführen

source: The uploaded file did not contain any usable data.
de_de: Die hochgeladene Datei besaß keine nutzbaren Daten.

source: click here to go back
de_de: Hier klicken um zurückzukehren.

source: Upload a file
de_de: Datei hochladen

source: File:
de_de: Datei:

source: Create Preview
de_de: Vorschau erstellen

source: Help:
de_de: Hilfe:

source: Class-Deletion
de_de: Kurs-Löschung

source: Really delete the class?
de_de: Wollen sie wirklich den Kurs löschen?

source: Do you really want to delete the Class "%1"? All its data is inevitably lost when doing so!
de_de: Wollen sie wirklich den Kurs "%1" löschen? Alle Daten gehen unwiederbringlich verloren!

source: Yes
de_de: Ja

source: No, I dont want to delete the Class
de_de: Nein, ich will den Kurs nicht löschen

source: Mainmenu of the Classteacher-Module
de_de: Hauptmenü des Kursleiter-Moduls

source: Add a Classteacher
de_de: Einen Kursleiter hinzufügen

source: Display all Classteachers
de_de: Alle Kursleiter anzeigen

source: Import Classteachers by a CSV-file
de_de: Kursleiter mit einer CSV-Datei importieren

source: Delete a Classteacher
de_de: Einen Kursleiter löschen

source: Soli-Settings
de_de: Teilhabepaket-Einstellungen

source: Enable Soli
de_de: Teilhabepaket aktivieren

source: Is the Soli-Module enabled:
de_de: Ist das Soli-Modul aktiviert:

source: Soliprice
de_de: Teilhabepaketpreis

source: Is Soliprice Enabled:
de_de: Sind Teilhabepaket-Preise aktiviert:

source: Amount to Pay:
de_de: Zu bezahlender Betrag:

source: Commit Changes
de_de: Änderungen hochladen

source: Standard Actions
de_de: Standardaktionen

source: Recharge a Card
de_de: Eine Karte aufladen

source: Print Recharge Balance
de_de: Die Aufladungen erstellen

source: At:
de_de: Am:

source: Download Pdf
de_de: PDF herunterladen

source: Add to user
de_de: Zum Benutzer hinzufügen

source: Forename
de_de: Vorname

source: Lastname
de_de: Nachname

source: Change password?
de_de: Passwort verändern?

source: Password
de_de: Passwort

source: Repeat password
de_de: Passwort wiederholen

source: Email-address
de_de: Email-Adresse

source: Emailaddress
de_de: Emailadresse

source: Telephone-number
de_de: Telefonnummer

source: Telephonenumber
de_de: Telefonnummer

source: Birthday
de_de: Geburtstag

source: Account locked
de_de: Account gesperrt

source: Usergroups
de_de: Benutzergruppen

source: Grades and schoolyears
de_de: Klassen und Schuljahre

source: Cardnumber
de_de: Kartennummer

source: Pricegroup
de_de: Preisgruppe

source: No pricegroup existing
de_de: Keine Preisgruppe existiert

source: Credits
de_de: Guthaben

source: Submit
de_de: Änderungen hochladen

source: Reset passwords of all users
de_de: Passwörter aller Nutzer zurücksetzen

source: Here you can reset the passwords of all users to the preset password.
de_de: Hier können sie die Passwörter aller Nutzer zu den voreingestellten Passwort zurücksetzen.

source: You will reset the passwords of all users (but the one which id is 1, usually the Superadmin) to the preset password. Thus this may be true for your password, too! If you can't log in after resetting the passwords, try the preset password.
de_de: Sie werden Passwörter aller Benutzer (außer Benutzer mit ID=1, welcher normalerweise der SuperAdmin ist) auf das voreingestellte Passwort zurücksetzen. Dies gilt somit wahrscheinlich auch für ihr Passwort! Falls sie sich nach dem Zurücksetzen also nicht mehr einloggen können, probieren sie das voreingestellte Passwort aus.

source: Click here
de_de: Klicken sie hier

source: to change the preset password.
de_de: um das voreingestellte Passwort zu verändern.

source: !!!Important!!!
de_de: !!!WICHTIG!!!

source: After the reset manually change the passwords of all accounts that have access to the Administrator-Section, else everyone can log themselfes into the Administrator-Section if they know the username!
de_de: Ändern sie nach dem Zurücksetzen manuell für alle wichtigen Accounts (diejenigen, die Zugriff auf den Administratorbereich haben) die Passwörter, da sonst jeder sich mit dem Passwort einloggen kann!

source: At the moment the preset password is not set. Please
de_de: Momentan ist kein voreingestelltes Passwort gesetzt. Bitte

source: click here
de_de: klicken sie hier

source: to set a preset password.
de_de: um ein voreingestelltes Passwort zu setzen.

source: Yes, I want to reset the passwords!
de_de: Ja, ich möchte die Passwörter zurücksetzen!

source: use preset password
de_de: Benutze voreingestelltes Passwort

source: Usersettings-Mainmenu
de_de: Benutzereinstellungs-Hauptmenü

source: General
de_de: Allgemein

source: Register a User
de_de: Benutzer registrieren

source: Show Users
de_de: Benutzer anzeigen

source: Assign Usernames to User automatically
de_de: Benutzernamen der Benutzer automatisch erstellen

source: Remove Specialcharacters from Usernames
de_de: Spezialschriftzeichen von den Benutzernamen entfernen

source: Import Users by a CSV-File
de_de: Benutzer mit einer CSV-Datei importieren

source: Reset passwords of users to preset passwords
de_de: Die Passwörter von Nutzern zum voreingestellten Passwort zurücksetzen.

source: Update users with Schoolyear-change
de_de: Benutzer mit Schuljahreswechsel aktualisieren

source: User-update menu
de_de: Benutzeraktualisierungsmenü

source: Conflicts
de_de: Konflikte

source: conflicts open
de_de: offene Konflikte

source: conflicts resolved
de_de: gelöste Konflikte

source: Resolve conflicts
de_de: Konflikte lösen

source: Display changes-overview
de_de: Veränderungsübersicht anzeigen

source: Execute changes
de_de: Änderungen ausführen

source: Update users and change the schoolyear
de_de: Benutzer aktualisieren und Schuljahr verändern

source: Here you can change the schoolyear and at the same time update the grades of the users with a csv-file.
de_de: Hier können sie das Schuljahr verändern und gleichzeitig die Klassen der Benutzer mit einer CSV-Datei aktualisieren.

source: Begin change
de_de: Mit Veränderungen starten

source: Csv-file help
de_de: Hilfe zur Csv-Datei

source: Select schoolyear
de_de: Schuljahr auswählen

source: Please select a schoolyear to switch to when changes get applied:
de_de: Bitte wählen sie ein Schuljahr aus zu dem gewechselt werden soll, wenn die Änderungen angewendet werden:

source: When full-year switch get selected, it will be assumed that the normal behaviour is that the users move one gradelevel up.
de_de: Wenn Schuljahreswechsel ausgewählt wird wird angenommen dass normalerweise die Benutzer einen Jahrgang höher versetzt werden.

source: Is it a half-year switch or a full-year switch?
de_de: Ist es ein Halbjahres- oder Schuljahreswechsel?

source: To which usergroup should new users be assigned?
de_de: Zu welcher Benutzergruppe sollen neue Nutzer hinzugefügt werden?

source: None
de_de: Keine

source: No user-groups found.
de_de: Keine Nutzergruppen gefunden.

source: continue
de_de: weiter

source: There is no schoolyear you can switch to. Please add a schoolyear and then try again.
de_de: Es gibt kein Schuljahr zu dem sie wechseln könnten. Bitte fügen sie ein Schuljahr hinzu und versuchen sie es nochmal.

source: Add a schoolyear
de_de: Ein Schuljahr hinzufügen

source: Import userdata with a csv-file
de_de: Benutzerdaten mit einer CSV-Datei importieren

source: Please select the csv-file that contains the data of the users:
de_de: Bitte wählen sie die CSV-Datei aus welche die Daten der Nutzer beinhaltet:

source: Upload
de_de: hochladen

source: Help for formatting the csv-file to update users
de_de: Hilfe zur Formatierung der Csv-Datei zur Benutzeraktualisierung

source: Use the semicolon (;) as a separator. Make sure the csv-file contains the following columns:
de_de: Benutzen sie das Semikolon (;) als Separator. Stellen sie sicher dass die Csv-Datei die folgenden Spalten besitzt:

source: The forename of the user
de_de: Der Vorname des Benutzers

source: The lastname of the user
de_de: Der Nachname des Benutzers

source: The grade the user should be switched to
de_de: Die Klasse zu der der Benutzer wechselt

source: Additionally, following columns can be added:
de_de: Zusätzlich können noch folgende Spalten hinzugefügt werden:

source: Neccessary if the birthdays of the users are already in the program!
de_de: Nötig wenn die Geburtstage der Benutzer bereits im Programm sind!

source: The birthday of the user. Used to distinguish users with the same forename and name.
de_de: Der Geburtstag des Benutzers. Benutzt um Nutzer mit demselben Vor- und Nachnamen zu unterscheiden.

source: The new telephone-number of the user. When this column exists, the old entries will be overridden, even if the new telephone-number is void!
de_de: Die neue Telefonnummer des Nutzers. Wenn diese Spalte existiert, werden die vorhandenen Einträge überschrieben, selbst wenn die neue telefonnummer leer ist!

source: The new username of the user. When this column exists, the old entries will be overridden, even if the new username is void!
de_de: Der neue Nutzername des Nutzers. Wenn diese Spalte existiert, werden die bereits vorhandenen Einträge überschrieben, selbst wenn der neue Nutzername leer ist!

source: Example of a csv-file:
de_de: Beispiel einer Csv-Datei:

source: Another example:
de_de: Weiteres Beispiel:

source: Yes to all
de_de: Ja zu allem

source: User not found in program
de_de: Benutzer im Programm nicht gefunden

source: User existing but not found in new file
de_de: Benutzer existiert, wurde aber nicht in der neuen Datei gefunden

source: Users old and new gradelevels differ too much
de_de: Die Differenz zwischen altem und neuem Jahrgang des Nutzers ist zu groß

source: The user <span class="highlighted">"%1 %2"</span> (birthday: <span class="highlighted">"%3"</span>), that will be in grade <span class="highlighted">"%3"</span>, is new. Is that correct?
de_de: Der Nutzer <span class="highlighted">"%1 %2"</span> (Geburtstag: <span class="highlighted">"%3"</span>), der in der Klasse <span class="highlighted">"%4"</span> sein wird, ist neu. Ist das korrekt?

source: No
de_de: Nein

source: The user <span class="highlighted">"%1 %2"</span> (birthday: <span class="highlighted">"%3"</span>) is not in the upcoming schoolyear. Is that correct?
de_de: Der Nutzer <span class="highlighted">"%1 %2"</span> (Geburtstag: <span class="highlighted">"%3"</span>) ist nicht im neuen Schuljahr. Ist das korrekt?

source: The grade of the user <span class="highlighted">"%1 %2"</span> (birthday: <span class="highlighted">"%3"</span>) changed from "%4" to "%5". Is that correct?
de_de: Die Klasse vom Benutzer <span class="highlighted">"%1 %2"</span> (Geburtstag: <span class="highlighted">"%3"</span>) hat sich von "%4" auf "%5" verändert. Ist das korrekt?

source: Submit changes
de_de: Änderungen hochladen

source: Cancel changes
de_de: Änderungen abbrechen

source: No conflicts exist.
de_de: Es existieren keine Konflikte.

source: Answered with yes
de_de: Mit Ja beantwortet

source: Answered with no
de_de: Mit nein beantwortet

source: changed to user:
de_de: geändert zu Benutzer:

source: Please give the correct new grade of the user:
de_de: Bitte geben sie die korrekte neue Klasse des Benutzers an:

source: finished
de_de: fertig

source: The new grade of the user will be:
de_de: Die neue Klasse des Benutzers wird sein:

source: Back to Useradministration
de_de: Zurück zur Benutzerverwaltung

source: Go to the existing update-Process
de_de: Zum existierenden Aktualisierungsprozess gehen

source: Start a new update-process
de_de: Einen neuen Aktualisierungsprozess starten

source: Search (Enter to commit)
de_de: Suchen (Enter um Suche abzusenden)

source: Search...
de_de: Suchen...

source: What Columns should be displayed
de_de: Welche Spalten angezeigt werden sollen

source: Columns
de_de: Spalten

source: Pdfs of deleted users
de_de: Pdfs der gelöschten Nutzer

source: Rows per page
de_de: Reihen pro Seite

source: Previous
de_de: Vorherige

source: Next
de_de: Nächste

source: Home
de_de: Startseite

source: Logout
de_de: Ausloggen

source: Sorry! An error occured. We could not handle your request.
de_de: Sorry! Ein Fehler ist aufgetreten. Wir konnten deine Anfrage nicht bearbeiten.

source: back
de_de: zurück

source: Information
de_de: Hinweis

source: Success!
de_de: Erfolgreich!

source: Unregister from all classes at this day
de_de: Von allen Kursen an diesem Tag abmelden

source: Help
de_de: Hilfe

source: Settings
de_de: Einstellungen

source: Actions:
de_de: Aktionen:

source: Contact:
de_de: Kontakt:

source: More:
de_de: Mehr:

source: The session is invalid, please login again
de_de: Die Sitzung ist abgelaufen, bitte logge dich nochmal ein.

source: User not found or incorrect password
de_de: Benutzer nicht gefunden oder inkorrektes Passwort

source: Please fill out the form completely.
de_de: Bitte fülle das Formular komplett aus.

source: Could not find the User by Cardnumber %1$s
de_de: Konnte den Nutzer anhand der Kartennummer "%1$s" nicht finden

source: Mealdate at weekend not valid!
de_de: Mahlzeitendatum wurde am Wochenende gewählt, ist nicht korrekt!

source: The value for the maximum amount of orders per Day for a User was successfully changed
de_de: Der Wert für die Maximale Anzahl an Bestellung pro Tag für die Benutzer wurden erfolgreich geändet

source: Maximum number of orders per day
de_de: Maximale Anzahl an Bestellungen pro Tag

source: Could not change the Max Amount of Orders per day per User.
de_de: Konnte die Maximale Anzahl an Bestellungen pro Tag nicht ändern.

source: An Error occured while fetching the infotexts!
de_de: Ein Fehler ist beim Abrufen der Infotexte aufgetreten!

source: The Infotexts where successfully changed!
de_de: Die Infotexte wurden erfolgreich geändert

source: Could not change the Infotext!
de_de: Konnte die Infotexte nicht verändern!

source: Useraccount is locked!
de_de: Der Benutzeraccount ist gesperrt!

source: Could not fetch the User by Card-ID %1$s
de_de: Konnte den Benutzer anhand der KartenID %1$s nicht abrufen!

source: Could not check if the Useraccount of User-ID %1$s is locked or not
de_de: Konnte nicht überprüfen ob der Benutzeraccount des Benutzers mit der ID %1$s geschlossen ist oder nicht

source: Could not check if the Useraccount of User-ID %1$s is locked or not. Could not find the User!
de_de: Konnte nicht überprüfen ob der Benutzeraccount des Benutzers mit der ID %1$s geschlossen ist oder nicht: Konnte den Benutzer nicht finden!

source: Could not fetch the Max Credits for the User with the ID %1$s
de_de: Konnte das maximale Guthaben des Benutzers mit der ID %1$s nicht abrufen

source: Could not fetch the Max Credits for the User with the ID %1$s; It looks like the User is not in any Pricegroup?
de_de: Konnte nicht das Maximale Guthaben für den Nutzer mit der ID "%1$s" abrufen; Es sieht so aus als währe der Nutzer in keiner Preisklasse

source: The given amount to recharge added to the Credits is more than the Maximum Amount of Credits allowed for the Users Pricegroup!
de_de: Die Aufladung des Guthabens um so viel Geld würde das Maximale Guthaben für diese Preisgruppe übersteigen!

source: Could not upload the recharge of the credits!
de_de: Konnte die Aufladung nicht hochladen!

source: Could not track the Recharge!
de_de: Konnte die Aufladung nicht loggen!

source: Username not found!
de_de: Benutzername nicht gefunden!

source: Sum:
de_de: Summe:

source: Balance-Print for the days from %1$s to %2$s
de_de: Rechnung für die Tage vom %1$s bis zum %2$s

source: Could not parse the given Interval
de_de: Konne die gegebene Zeitspanne nicht nutzen!!

source: Could not fetch the Recharges!
de_de: Konnte die Aufladungen nicht abrufen!

source: Week
de_de: Woche

source: Month
de_de: Monat

source: Year
de_de: Jahr

source: Could not check if the User is Soli or not.
de_de: Konnte nicht überprüfen ob der Benutzer Teilhabepaketberechtigt ist oder nicht

source: The Settings were successfully changed
de_de: Die Einstellungen wurden erfolgreich geändert

source: Could not fetch the Data!
de_de: Konnte die Daten nicht abrufen!

source: Could not initialize the Soliprice!
de_de: Konnte den Solipreis nicht setzen!

source: Could not change the Soliprice!
de_de: Konnte den SoliPreis nicht verändern!

source: Could not Initialize the isSolipriceEnabled-Variable
de_de: Konnte nicht den Solipreis-aktiviert Status setzen

source: Could not set if the Soliprice is enabled or not
de_de: Konnte den Solipreis-Aktiviert Status nicht setzen

source: The Class was successfully added.
de_de: Der Kurs wurde erfolgreich hinzugefügt

source: Could not fetch the Schoolyears!
de_de: Konnte die Schuljahre nicht abrufen!

source: Could not fetch the Classunits!
de_de: Konnte die Kurseinheiten nicht abrufen!

source: Classname
de_de: Kursname

source: Classdescription
de_de: Kursbeschreibung

source: Max Amount of Registrations for this Class
de_de: Maximale Anzahl der Registrierungen für diesen Kurs

source: Classunit
de_de: Kurseinheiten

source: Schoolyear-ID
de_de: Schuljahres-ID

source: Allow registration
de_de: Registrierung erlauben

source: Could not add the new Class!
de_de: Konnte den neuen Kurs nicht hinzufügen!

source: The Class was successfully changed.
de_de: Der Kurs wurde erfolgreich geändert.

source: Could not fetch the data!
de_de: Konnte die Daten nicht abrufen!

source: The Class was not deleted.
de_de: Der Kurs wurde nicht gelöscht

source: Class to delete not found!
de_de: Der zu löschende Kurs wurde nicht gefunden!

source: Class-ID
de_de: Kurs-ID

source: The Class was successfully deleted
de_de: Der Kurs wurde erfolgreich gelöscht

source: Could not delete the Class!
de_de: Der Kurs konnte nicht gelöscht werden!

source: Could not fetch the active Schoolyear!
de_de: Konnte die Kurse des aktiven Schuljahres nicht abrufen

source: There is no active Schoolyear set!
de_de: Kein aktives Schuljahr wurde gesetzt!

source: Could not fetch the Classes by SchoolyearId $1%s
de_de: Konnte die Klassen anhand der SchuljahrId %1$s nicht abrufen!

source: Could not fetch the Class(es)!
de_de: Konnte die Kurse/den Kurs nicht abrufen!

source: Could not fetch the Users by Class
de_de: Konnte die Benutzer des Kurses nicht abrufen!

source: Could not fetch the Classes of the User at the same day
de_de: Konnte die Kurse des Benutzers, die am selben tag stattfinden, nicht abrufen

source: Error fetching the Statuses!
de_de: Konnte die Statuse nicht abrufen

source: The Global Classregistration was successfully changed.
de_de: Die Kursregistrationen wurde erfolgreich verändert.

source: Could not change the Global Classregistration!
de_de: Konnte die Kursregistrationen nicht verändern!

source: Could not change the individual classregistrations!
de_de: Konnte die Kursregistrationen der jeweiligen Kurse nicht verändern!

source: Could not check whether the global Classregistration isenabled or not.
de_de: Konnte nicht herausfinden ob der "ist Kursregistration erlaubt"-Schalter aktiviert ist oder nicht.

source: Could not add the Global Classregistration setting!
de_de: Konnte den "ist Kursregistration erlaubt"-Schalter nicht hinzufügen!

source: The Classes were successfully imported.
de_de: Die Kurse wurden erfolgreich importiert.

source: No classes given.
de_de: Keine Kurse gegeben.

source: Could not execute the Query!
de_de: Konnte die Query nicht ausführen!

source: Could not find uploaded file
de_de: Konnte die hochgeladene Datei nicht finden

source: Could not fetch the Classteachers.
de_de: Konnte die Kursleiter nicht abrufen!

source: Could not fetch the days.
de_de: Konnte die Tage nicht abrufen!

source: The CSV-File uploaded has not all columns it needs to have. Please upload a CSV-File with all columns!
de_de: Die hochgeladene CSV-Dateil hat nicht alle Spalten die sie haben sollte. Bitte laden sie eine CSV-Datei mit allen nötigen Spalten hoch!

source: Could not fetch the Classes of the Active Schoolyear
de_de: Konnte nicht die Kurse des aktiven Schuljahres abrufen

source: The Classteacher was successfully added.
de_de: Der Kurslehrer wurde erfolgreich hinzugefügt

source: Surname
de_de: Nachname

source: Address
de_de: Adresse

source: Telephone Number
de_de: Telefonnummer

source: You cant choose that the Classteacher has No Classes AND select classes!
de_de: Sie können nicht wählen dass der Kursleiter gleichzeitig "keine Kurse" hat und dabei Kurse auswählen!

source: Could not add the Classteacher!
de_de: Konnte den Kursleiter nicht hinzufügen!

source: Could not add the Classes to the Classteacher!
de_de: Konnte die Kurse des Kursleiters nicht hinzufügen!

source: No ID given!
de_de: Keine ID gegeben!

source: The Classteacher was successfully changed.
de_de: Der Kursleiter wurde erfolgreich verändert.

source: Could not change the Classteacher!
de_de: Konnte den Kursleiter nicht verändern!

source: Could not change the Classes of the Classteacher!
de_de: Konnte die Kurse des Kursleiters nicht verändern!

source: Could not fetch the Classes of the Classteacher!
de_de: Konnte die Kurse des Kursleiters nicht abrufen!

source: The Classteacher was successfully deleted!
de_de: Der Kursleiter wurde erfolgreich gelöscht.

source: Id is not set!
de_de: Die ID wurde nicht gesetzt!
