Repository: LinuCC/BaBeSK
Catalog: code/locale/*/LC_MESSAGES/BaBeSK_*.po
Languages: de_de

source: You can only select a class as either primary or secondary, not both at once!
de_de: Du kannst einen Kurs nur als Primärwunsch oder Sekundärwunsche auswählen, nicht beides gleichzeitig!

source: You have selected a class at a day at which you have already selected classes. Please undo your choices and then try again if you want to change them!
de_de: Du hast einen Kurs an einem Tag gewählt an dem du dich bereits für einen Kurs registriert hast. Bitte mache deine Wahlen im Hauptmenü rückgängig und versuche nochmal dich für die jetzt gewählten Kurse zu registrieren wenn du sie verändern willst!

source: Classregistrations are disabled!
de_de: Kursregistrierungen sind deaktiviert!

source: One or more classes you have chosen are not enabled!
de_de: Eine oder mehrere Kurse die du gewählt hast sind gesperrt!

source: For a specific day you did not chose a primary request, but you did chose a secondary request. If you only have one request at this day, please select the class as a primary request.
de_de: Du hast an einem Tag keinen Primärwunsch, aber einen Sekundärwunsch ausgewählt. Wenn du nur einen Wunsch für diesen Tag hast, wähle den Kurs bitte als Erstwunsch.

source: Could not commit your choices!
de_de: Konnte deine Wahlen nicht hochladen!

source: Could not fetch your Classes!
de_de: Konnte deine Kurse nicht abrufen!

source: You were not unregistered from any classes.
de_de: Du wurdest von keinem Kurs abgemeldet.

source: Unregistered you from %1$s classes.
de_de: Du wurdest von %1$s Kursen abgemeldet.

source: Could not unregister you from your classes!
de_de: Konnte dich nicht von deinen Kursen abmelden!
